// Найти значение функции y = 3x6 − 6x2 − 7 при данном значении x.
Console.WriteLine("введите х: ");
int x = Convert.ToInt32(Console.ReadLine());
int otv = 3 * x - 6 * x - 7;
Console.WriteLine($"y = {otv}");